GopalSaraf/Practicals/PSDL/include/proc/pic16f18426.h
extern volatile T5CONbits_t T5CONbits __at(0x21A);
// bitfield macros
#define _T5CON_ON_POSN                                      0x0
#define _T5CON_ON_POSITION                                  0x0
#define _T5CON_ON_SIZE                                      0x1
#define _T5CON_ON_LENGTH                                    0x1
#define _T5CON_ON_MASK                                      0x1
#define _T5CON_RD16_POSN                                    0x1
#define _T5CON_RD16_POSITION                                0x1
#define _T5CON_RD16_SIZE                                    0x1
#define _T5CON_RD16_LENGTH                                  0x1
#define _T5CON_RD16_MASK                                    0x2
#define _T5CON_NOT_SYNC_POSN                                0x2
#define _T5CON_NOT_SYNC_POSITION                            0x2
#define _T5CON_NOT_SYNC_SIZE                                0x1
#define _T5CON_NOT_SYNC_LENGTH                              0x1
#define _T5CON_NOT_SYNC_MASK                                0x4
#define _T5CON_CKPS_POSN                                    0x4
#define _T5CON_CKPS_POSITION                                0x4
#define _T5CON_CKPS_SIZE                                    0x2
#define _T5CON_CKPS_LENGTH                                  0x2
#define _T5CON_CKPS_MASK                                    0x30
#define _T5CON_TMR5ON_POSN                                  0x0
#define _T5CON_TMR5ON_POSITION                              0x0
#define _T5CON_TMR5ON_SIZE                                  0x1
#define _T5CON_TMR5ON_LENGTH                                0x1
#define _T5CON_TMR5ON_MASK                                  0x1
#define _T5CON_T5RD16_POSN                                  0x1
#define _T5CON_T5RD16_POSITION                              0x1
#define _T5CON_T5RD16_SIZE                                  0x1
#define _T5CON_T5RD16_LENGTH                                0x1
#define _T5CON_T5RD16_MASK                                  0x2
#define _T5CON_NOT_T5SYNC_POSN                              0x2
#define _T5CON_NOT_T5SYNC_POSITION                          0x2
#define _T5CON_NOT_T5SYNC_SIZE                              0x1
#define _T5CON_NOT_T5SYNC_LENGTH                            0x1
#define _T5CON_NOT_T5SYNC_MASK                              0x4
#define _T5CON_T5CKPS0_POSN                                 0x4
#define _T5CON_T5CKPS0_POSITION                             0x4
#define _T5CON_T5CKPS0_SIZE                                 0x1
#define _T5CON_T5CKPS0_LENGTH                               0x1
#define _T5CON_T5CKPS0_MASK                                 0x10
#define _T5CON_T5CKPS1_POSN                                 0x5
#define _T5CON_T5CKPS1_POSITION                             0x5
#define _T5CON_T5CKPS1_SIZE                                 0x1
#define _T5CON_T5CKPS1_LENGTH                               0x1
#define _T5CON_T5CKPS1_MASK                                 0x20
#define _T5CON_CKPS0_POSN                                   0x4
#define _T5CON_CKPS0_POSITION                               0x4
#define _T5CON_CKPS0_SIZE                                   0x1
#define _T5CON_CKPS0_LENGTH                                 0x1
#define _T5CON_CKPS0_MASK                                   0x10
#define _T5CON_CKPS1_POSN                                   0x5
#define _T5CON_CKPS1_POSITION                               0x5
#define _T5CON_CKPS1_SIZE                                   0x1
#define _T5CON_CKPS1_LENGTH                                 0x1
#define _T5CON_CKPS1_MASK                                   0x20
#define _T5CON_RD165_POSN                                   0x1
#define _T5CON_RD165_POSITION                               0x1
#define _T5CON_RD165_SIZE                                   0x1
#define _T5CON_RD165_LENGTH                                 0x1
#define _T5CON_RD165_MASK                                   0x2
// alias bitfield definitions
typedef union {
    struct {
        unsigned ON                     :1;
        unsigned RD16                   :1;
        unsigned NOT_SYNC               :1;
        unsigned                        :1;
        unsigned CKPS                   :2;
    };
    struct {
        unsigned TMR5ON                 :1;
        unsigned T5RD16                 :1;
        unsigned NOT_T5SYNC             :1;
        unsigned                        :1;
        unsigned T5CKPS0                :1;
        unsigned T5CKPS1                :1;
    };
    struct {
        unsigned                        :4;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned RD165                  :1;
    };
} TMR5CONbits_t;
extern volatile TMR5CONbits_t TMR5CONbits __at(0x21A);
// bitfield macros
#define _TMR5CON_ON_POSN                                    0x0
#define _TMR5CON_ON_POSITION                                0x0
#define _TMR5CON_ON_SIZE                                    0x1
#define _TMR5CON_ON_LENGTH                                  0x1
#define _TMR5CON_ON_MASK                                    0x1
#define _TMR5CON_RD16_POSN                                  0x1
#define _TMR5CON_RD16_POSITION                              0x1
#define _TMR5CON_RD16_SIZE                                  0x1
#define _TMR5CON_RD16_LENGTH                                0x1
#define _TMR5CON_RD16_MASK                                  0x2
#define _TMR5CON_NOT_SYNC_POSN                              0x2
#define _TMR5CON_NOT_SYNC_POSITION                          0x2
#define _TMR5CON_NOT_SYNC_SIZE                              0x1
#define _TMR5CON_NOT_SYNC_LENGTH                            0x1
#define _TMR5CON_NOT_SYNC_MASK                              0x4
#define _TMR5CON_CKPS_POSN                                  0x4
#define _TMR5CON_CKPS_POSITION                              0x4
#define _TMR5CON_CKPS_SIZE                                  0x2
#define _TMR5CON_CKPS_LENGTH                                0x2
#define _TMR5CON_CKPS_MASK                                  0x30
#define _TMR5CON_TMR5ON_POSN                                0x0
#define _TMR5CON_TMR5ON_POSITION                            0x0
#define _TMR5CON_TMR5ON_SIZE                                0x1
#define _TMR5CON_TMR5ON_LENGTH                              0x1
#define _TMR5CON_TMR5ON_MASK                                0x1
#define _TMR5CON_T5RD16_POSN                                0x1
#define _TMR5CON_T5RD16_POSITION                            0x1
#define _TMR5CON_T5RD16_SIZE                                0x1
#define _TMR5CON_T5RD16_LENGTH                              0x1
#define _TMR5CON_T5RD16_MASK                                0x2
#define _TMR5CON_NOT_T5SYNC_POSN                            0x2
#define _TMR5CON_NOT_T5SYNC_POSITION                        0x2
#define _TMR5CON_NOT_T5SYNC_SIZE                            0x1
#define _TMR5CON_NOT_T5SYNC_LENGTH                          0x1
#define _TMR5CON_NOT_T5SYNC_MASK                            0x4
#define _TMR5CON_T5CKPS0_POSN                               0x4
#define _TMR5CON_T5CKPS0_POSITION                           0x4
#define _TMR5CON_T5CKPS0_SIZE                               0x1
#define _TMR5CON_T5CKPS0_LENGTH                             0x1
#define _TMR5CON_T5CKPS0_MASK                               0x10
#define _TMR5CON_T5CKPS1_POSN                               0x5
#define _TMR5CON_T5CKPS1_POSITION                           0x5
#define _TMR5CON_T5CKPS1_SIZE                               0x1
#define _TMR5CON_T5CKPS1_LENGTH                             0x1
#define _TMR5CON_T5CKPS1_MASK                               0x20
#define _TMR5CON_CKPS0_POSN                                 0x4
#define _TMR5CON_CKPS0_POSITION                             0x4
#define _TMR5CON_CKPS0_SIZE                                 0x1
#define _TMR5CON_CKPS0_LENGTH                               0x1
#define _TMR5CON_CKPS0_MASK                                 0x10
#define _TMR5CON_CKPS1_POSN                                 0x5
#define _TMR5CON_CKPS1_POSITION                             0x5
#define _TMR5CON_CKPS1_SIZE                                 0x1
#define _TMR5CON_CKPS1_LENGTH                               0x1
#define _TMR5CON_CKPS1_MASK                                 0x20
#define _TMR5CON_RD165_POSN                                 0x1
#define _TMR5CON_RD165_POSITION                             0x1
#define _TMR5CON_RD165_SIZE                                 0x1
#define _TMR5CON_RD165_LENGTH                               0x1
#define _TMR5CON_RD165_MASK                                 0x2

// Register: T5GCON
#define T5GCON T5GCON
extern volatile unsigned char           T5GCON              __at(0x21B);
#ifndef _LIB_BUILD
asm("T5GCON equ 021Bh");
#endif
// aliases
extern volatile unsigned char           TMR5GCON            __at(0x21B);
#ifndef _LIB_BUILD
asm("TMR5GCON equ 021Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO                    :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned T5GVAL                 :1;
        unsigned T5GGO                  :1;
        unsigned T5GSPM                 :1;
        unsigned T5GTM                  :1;
        unsigned T5GPOL                 :1;
        unsigned T5GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_DONE               :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_T5DONE             :1;
    };
} T5GCONbits_t;
