GopalSaraf/Practicals/PSDL/include/proc/pic16f18426.h
// Register: CCP4CAP
#define CCP4CAP CCP4CAP
extern volatile unsigned char           CCP4CAP             __at(0x31B);
#ifndef _LIB_BUILD
asm("CCP4CAP equ 031Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :8;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
    };
    struct {
        unsigned CCP4CTS                :8;
    };
    struct {
        unsigned CCP4CTS0               :1;
        unsigned CCP4CTS1               :1;
        unsigned CCP4CTS2               :1;
    };
} CCP4CAPbits_t;
extern volatile CCP4CAPbits_t CCP4CAPbits __at(0x31B);
// bitfield macros
#define _CCP4CAP_CTS_POSN                                   0x0
#define _CCP4CAP_CTS_POSITION                               0x0
#define _CCP4CAP_CTS_SIZE                                   0x8
#define _CCP4CAP_CTS_LENGTH                                 0x8
#define _CCP4CAP_CTS_MASK                                   0xFF
#define _CCP4CAP_CTS0_POSN                                  0x0
#define _CCP4CAP_CTS0_POSITION                              0x0
#define _CCP4CAP_CTS0_SIZE                                  0x1
#define _CCP4CAP_CTS0_LENGTH                                0x1
#define _CCP4CAP_CTS0_MASK                                  0x1
#define _CCP4CAP_CTS1_POSN                                  0x1
#define _CCP4CAP_CTS1_POSITION                              0x1
#define _CCP4CAP_CTS1_SIZE                                  0x1
#define _CCP4CAP_CTS1_LENGTH                                0x1
#define _CCP4CAP_CTS1_MASK                                  0x2
#define _CCP4CAP_CTS2_POSN                                  0x2
#define _CCP4CAP_CTS2_POSITION                              0x2
#define _CCP4CAP_CTS2_SIZE                                  0x1
#define _CCP4CAP_CTS2_LENGTH                                0x1
#define _CCP4CAP_CTS2_MASK                                  0x4
#define _CCP4CAP_CCP4CTS_POSN                               0x0
#define _CCP4CAP_CCP4CTS_POSITION                           0x0
#define _CCP4CAP_CCP4CTS_SIZE                               0x8
#define _CCP4CAP_CCP4CTS_LENGTH                             0x8
#define _CCP4CAP_CCP4CTS_MASK                               0xFF
#define _CCP4CAP_CCP4CTS0_POSN                              0x0
#define _CCP4CAP_CCP4CTS0_POSITION                          0x0
#define _CCP4CAP_CCP4CTS0_SIZE                              0x1
#define _CCP4CAP_CCP4CTS0_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS0_MASK                              0x1
#define _CCP4CAP_CCP4CTS1_POSN                              0x1
#define _CCP4CAP_CCP4CTS1_POSITION                          0x1
#define _CCP4CAP_CCP4CTS1_SIZE                              0x1
#define _CCP4CAP_CCP4CTS1_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS1_MASK                              0x2
#define _CCP4CAP_CCP4CTS2_POSN                              0x2
#define _CCP4CAP_CCP4CTS2_POSITION                          0x2
#define _CCP4CAP_CCP4CTS2_SIZE                              0x1
#define _CCP4CAP_CCP4CTS2_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS2_MASK                              0x4

// Register: PWM6DC
#define PWM6DC PWM6DC
extern volatile unsigned short          PWM6DC              __at(0x38C);
#ifndef _LIB_BUILD
asm("PWM6DC equ 038Ch");
#endif

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
extern volatile unsigned char           PWM6DCL             __at(0x38C);
#ifndef _LIB_BUILD
asm("PWM6DCL equ 038Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM6DC0                :1;
        unsigned PWM6DC1                :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM6DCLbits_t;
extern volatile PWM6DCLbits_t PWM6DCLbits __at(0x38C);
// bitfield macros
#define _PWM6DCL_DC_POSN                                    0x6
#define _PWM6DCL_DC_POSITION                                0x6
#define _PWM6DCL_DC_SIZE                                    0x2
#define _PWM6DCL_DC_LENGTH                                  0x2
#define _PWM6DCL_DC_MASK                                    0xC0
#define _PWM6DCL_DC0_POSN                                   0x6
#define _PWM6DCL_DC0_POSITION                               0x6
#define _PWM6DCL_DC0_SIZE                                   0x1
#define _PWM6DCL_DC0_LENGTH                                 0x1
#define _PWM6DCL_DC0_MASK                                   0x40
#define _PWM6DCL_DC1_POSN                                   0x7
#define _PWM6DCL_DC1_POSITION                               0x7
#define _PWM6DCL_DC1_SIZE                                   0x1
#define _PWM6DCL_DC1_LENGTH                                 0x1
#define _PWM6DCL_DC1_MASK                                   0x80
#define _PWM6DCL_PWM6DC0_POSN                               0x6
#define _PWM6DCL_PWM6DC0_POSITION                           0x6
#define _PWM6DCL_PWM6DC0_SIZE                               0x1
#define _PWM6DCL_PWM6DC0_LENGTH                             0x1
#define _PWM6DCL_PWM6DC0_MASK                               0x40
#define _PWM6DCL_PWM6DC1_POSN                               0x7
#define _PWM6DCL_PWM6DC1_POSITION                           0x7
#define _PWM6DCL_PWM6DC1_SIZE                               0x1
#define _PWM6DCL_PWM6DC1_LENGTH                             0x1
#define _PWM6DCL_PWM6DC1_MASK                               0x80
#define _PWM6DCL_PWMPW0_POSN                                0x6
#define _PWM6DCL_PWMPW0_POSITION                            0x6
#define _PWM6DCL_PWMPW0_SIZE                                0x1
#define _PWM6DCL_PWMPW0_LENGTH                              0x1
#define _PWM6DCL_PWMPW0_MASK                                0x40
#define _PWM6DCL_PWMPW1_POSN                                0x7
#define _PWM6DCL_PWMPW1_POSITION                            0x7
#define _PWM6DCL_PWMPW1_SIZE                                0x1
#define _PWM6DCL_PWMPW1_LENGTH                              0x1
#define _PWM6DCL_PWMPW1_MASK                                0x80

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
extern volatile unsigned char           PWM6DCH             __at(0x38D);
#ifndef _LIB_BUILD
asm("PWM6DCH equ 038Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM6DC2                :1;
        unsigned PWM6DC3                :1;
        unsigned PWM6DC4                :1;
        unsigned PWM6DC5                :1;
        unsigned PWM6DC6                :1;
        unsigned PWM6DC7                :1;
        unsigned PWM6DC8                :1;
        unsigned PWM6DC9                :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM6DCHbits_t;
