GopalSaraf/Practicals/PSDL/include/proc/pic16f18426.h
// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0x71C);
#ifndef _LIB_BUILD
asm("PIE6 equ 071Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1IE                 :1;
        unsigned CCP2IE                 :1;
        unsigned CCP3IE                 :1;
        unsigned CCP4IE                 :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0x71C);
// bitfield macros
#define _PIE6_CCP1IE_POSN                                   0x0
#define _PIE6_CCP1IE_POSITION                               0x0
#define _PIE6_CCP1IE_SIZE                                   0x1
#define _PIE6_CCP1IE_LENGTH                                 0x1
#define _PIE6_CCP1IE_MASK                                   0x1
#define _PIE6_CCP2IE_POSN                                   0x1
#define _PIE6_CCP2IE_POSITION                               0x1
#define _PIE6_CCP2IE_SIZE                                   0x1
#define _PIE6_CCP2IE_LENGTH                                 0x1
#define _PIE6_CCP2IE_MASK                                   0x2
#define _PIE6_CCP3IE_POSN                                   0x2
#define _PIE6_CCP3IE_POSITION                               0x2
#define _PIE6_CCP3IE_SIZE                                   0x1
#define _PIE6_CCP3IE_LENGTH                                 0x1
#define _PIE6_CCP3IE_MASK                                   0x4
#define _PIE6_CCP4IE_POSN                                   0x3
#define _PIE6_CCP4IE_POSITION                               0x3
#define _PIE6_CCP4IE_SIZE                                   0x1
#define _PIE6_CCP4IE_LENGTH                                 0x1
#define _PIE6_CCP4IE_MASK                                   0x8

// Register: PIE7
#define PIE7 PIE7
extern volatile unsigned char           PIE7                __at(0x71D);
#ifndef _LIB_BUILD
asm("PIE7 equ 071Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG1IE                 :1;
        unsigned CWG2IE                 :1;
        unsigned                        :2;
        unsigned NCO1IE                 :1;
        unsigned NVMIE                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned NCOIE                  :1;
    };
} PIE7bits_t;
extern volatile PIE7bits_t PIE7bits __at(0x71D);
// bitfield macros
#define _PIE7_CWG1IE_POSN                                   0x0
#define _PIE7_CWG1IE_POSITION                               0x0
#define _PIE7_CWG1IE_SIZE                                   0x1
#define _PIE7_CWG1IE_LENGTH                                 0x1
#define _PIE7_CWG1IE_MASK                                   0x1
#define _PIE7_CWG2IE_POSN                                   0x1
#define _PIE7_CWG2IE_POSITION                               0x1
#define _PIE7_CWG2IE_SIZE                                   0x1
#define _PIE7_CWG2IE_LENGTH                                 0x1
#define _PIE7_CWG2IE_MASK                                   0x2
#define _PIE7_NCO1IE_POSN                                   0x4
#define _PIE7_NCO1IE_POSITION                               0x4
#define _PIE7_NCO1IE_SIZE                                   0x1
#define _PIE7_NCO1IE_LENGTH                                 0x1
#define _PIE7_NCO1IE_MASK                                   0x10
#define _PIE7_NVMIE_POSN                                    0x5
#define _PIE7_NVMIE_POSITION                                0x5
#define _PIE7_NVMIE_SIZE                                    0x1
#define _PIE7_NVMIE_LENGTH                                  0x1
#define _PIE7_NVMIE_MASK                                    0x20
#define _PIE7_NCOIE_POSN                                    0x4
#define _PIE7_NCOIE_POSITION                                0x4
#define _PIE7_NCOIE_SIZE                                    0x1
#define _PIE7_NCOIE_LENGTH                                  0x1
#define _PIE7_NCOIE_MASK                                    0x10

// Register: PIE8
#define PIE8 PIE8
extern volatile unsigned char           PIE8                __at(0x71E);
#ifndef _LIB_BUILD
asm("PIE8 equ 071Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1IE                 :1;
        unsigned SMT1PRAIE              :1;
        unsigned SMT1PWAIE              :1;
    };
} PIE8bits_t;
extern volatile PIE8bits_t PIE8bits __at(0x71E);
// bitfield macros
#define _PIE8_SMT1IE_POSN                                   0x0
#define _PIE8_SMT1IE_POSITION                               0x0
#define _PIE8_SMT1IE_SIZE                                   0x1
#define _PIE8_SMT1IE_LENGTH                                 0x1
#define _PIE8_SMT1IE_MASK                                   0x1
#define _PIE8_SMT1PRAIE_POSN                                0x1
#define _PIE8_SMT1PRAIE_POSITION                            0x1
#define _PIE8_SMT1PRAIE_SIZE                                0x1
#define _PIE8_SMT1PRAIE_LENGTH                              0x1
#define _PIE8_SMT1PRAIE_MASK                                0x2
#define _PIE8_SMT1PWAIE_POSN                                0x2
#define _PIE8_SMT1PWAIE_POSITION                            0x2
#define _PIE8_SMT1PWAIE_SIZE                                0x1
#define _PIE8_SMT1PWAIE_LENGTH                              0x1
#define _PIE8_SMT1PWAIE_MASK                                0x4

// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0x796);
#ifndef _LIB_BUILD
asm("PMD0 equ 0796h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCMD                  :1;
        unsigned CLKRMD                 :1;
        unsigned NVMMD                  :1;
        unsigned                        :3;
        unsigned FVRMD                  :1;
        unsigned SYSCMD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0x796);
// bitfield macros
#define _PMD0_IOCMD_POSN                                    0x0
#define _PMD0_IOCMD_POSITION                                0x0
#define _PMD0_IOCMD_SIZE                                    0x1
#define _PMD0_IOCMD_LENGTH                                  0x1
#define _PMD0_IOCMD_MASK                                    0x1
#define _PMD0_CLKRMD_POSN                                   0x1
#define _PMD0_CLKRMD_POSITION                               0x1
#define _PMD0_CLKRMD_SIZE                                   0x1
#define _PMD0_CLKRMD_LENGTH                                 0x1
#define _PMD0_CLKRMD_MASK                                   0x2
#define _PMD0_NVMMD_POSN                                    0x2
#define _PMD0_NVMMD_POSITION                                0x2
#define _PMD0_NVMMD_SIZE                                    0x1
#define _PMD0_NVMMD_LENGTH                                  0x1
#define _PMD0_NVMMD_MASK                                    0x4
#define _PMD0_FVRMD_POSN                                    0x6
#define _PMD0_FVRMD_POSITION                                0x6
#define _PMD0_FVRMD_SIZE                                    0x1
#define _PMD0_FVRMD_LENGTH                                  0x1
#define _PMD0_FVRMD_MASK                                    0x40
#define _PMD0_SYSCMD_POSN                                   0x7
#define _PMD0_SYSCMD_POSITION                               0x7
#define _PMD0_SYSCMD_SIZE                                   0x1
#define _PMD0_SYSCMD_LENGTH                                 0x1
#define _PMD0_SYSCMD_MASK                                   0x80

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0x797);
#ifndef _LIB_BUILD
asm("PMD1 equ 0797h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0MD                 :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned TMR5MD                 :1;
        unsigned TMR6MD                 :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0x797);
// bitfield macros
#define _PMD1_TMR0MD_POSN                                   0x0
#define _PMD1_TMR0MD_POSITION                               0x0
#define _PMD1_TMR0MD_SIZE                                   0x1
#define _PMD1_TMR0MD_LENGTH                                 0x1
#define _PMD1_TMR0MD_MASK                                   0x1
#define _PMD1_TMR1MD_POSN                                   0x1
#define _PMD1_TMR1MD_POSITION                               0x1
#define _PMD1_TMR1MD_SIZE                                   0x1
#define _PMD1_TMR1MD_LENGTH                                 0x1
#define _PMD1_TMR1MD_MASK                                   0x2
#define _PMD1_TMR2MD_POSN                                   0x2
#define _PMD1_TMR2MD_POSITION                               0x2
#define _PMD1_TMR2MD_SIZE                                   0x1
#define _PMD1_TMR2MD_LENGTH                                 0x1
#define _PMD1_TMR2MD_MASK                                   0x4
#define _PMD1_TMR3MD_POSN                                   0x3
#define _PMD1_TMR3MD_POSITION                               0x3
#define _PMD1_TMR3MD_SIZE                                   0x1
#define _PMD1_TMR3MD_LENGTH                                 0x1
#define _PMD1_TMR3MD_MASK                                   0x8
#define _PMD1_TMR4MD_POSN                                   0x4
#define _PMD1_TMR4MD_POSITION                               0x4
#define _PMD1_TMR4MD_SIZE                                   0x1
#define _PMD1_TMR4MD_LENGTH                                 0x1
#define _PMD1_TMR4MD_MASK                                   0x10
#define _PMD1_TMR5MD_POSN                                   0x5
#define _PMD1_TMR5MD_POSITION                               0x5
#define _PMD1_TMR5MD_SIZE                                   0x1
#define _PMD1_TMR5MD_LENGTH                                 0x1
#define _PMD1_TMR5MD_MASK                                   0x20
#define _PMD1_TMR6MD_POSN                                   0x6
#define _PMD1_TMR6MD_POSITION                               0x6
#define _PMD1_TMR6MD_SIZE                                   0x1
#define _PMD1_TMR6MD_LENGTH                                 0x1
#define _PMD1_TMR6MD_MASK                                   0x40

